tutorials/FSI/fsiFoam/beamInCrossFlow/fluid/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 8;

method          metis;

globalFaceZones ( interface-zone );

simpleCoeffs
{
    n               (2 2 2);
    delta           0.001;
}

metisCoeffs
{
}

distributed     no;

roots
(
);

// ************************************************************************* //
